Revit 2027 API
ParameterTypeId.ScheduleTypeForBrowser Property
 "Schedule Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ScheduleTypeForBrowser { get; }
Public Shared ReadOnly Property ScheduleTypeForBrowser As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ScheduleTypeForBrowser {
	ForgeTypeId^ get ();
}
static member ScheduleTypeForBrowser : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace